Autodesk.Revit.DB.Events.DocumentSaveToLocalProgressChangedEventArgs.SaveToLocalFinished
Indicates if the current "save to local" operation has finished.
Since:
2017 Subscription Update

Autodesk.Revit.DB.Events.DocumentSaveToLocalProgressChangedEventArgs.TotalStreams
The total expected number of streams to save to local.
Since:
2017 Subscription Update

Autodesk.Revit.DB.Events.DocumentSaveToLocalProgressChangedEventArgs.FinishedStreams
The number of streams finished since the last time this event was raised.
Since:
2017 Subscription Update

Autodesk.Revit.DB.Events.DocumentSaveToLocalProgressChangedEventArgs.BeforeSaveToCentral
True if the "save to local" operation is occurring before "save to central"; false if after.
Since:
2017 Subscription Update

Autodesk.Revit.DB.Events.DocumentSaveToLocalProgressChangedEventArgs.#ctor(Autodesk.Revit.DB.Events.DocumentSaveToLocalProgressChangedEventArgs)
Creates a copy of the DocumentSaveToLocalProgressChangedEventArgs.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2017 Subscription Update

Autodesk.Revit.DB.Events.DocumentSaveToLocalProgressChangedEventArgs
The event arguments used during the save to local phase of Autodesk::Revit::ApplicationServices::Application::WorksharedOperationProgressChanged.
Remarks:
It is NOT recommended to do any time-consuming work when handling WorksharedOperationProgressChanged event. This can increase workshared operation time.
Name correction - it is renamed from 'DocumentSaveToLocalProgessChangedEventArgs' released since 2017 Subscription Update.
Since:
2017 Subscription Update